In [1]:
import numpy as np
import pandas as pd

In [5]:
from numpy.random import randn
df = pd.DataFrame(randn(5,4), index="A B C D E".split(), columns="W X Y Z".split())
df

          W         X         Y         Z
A  0.927959 -1.604756  0.454756 -1.101338
B -0.593899 -0.697336 -0.373440 -1.385383
C -1.090538  1.660876 -0.576661 -0.188058
D  0.992114  2.440539  0.405185 -0.846037
E -1.131430 -0.860146  0.708441  0.133448

In [6]:
df['W']

A    0.927959
B   -0.593899
C   -1.090538
D    0.992114
E   -1.131430
Name: W, dtype: float64

In [7]:
df[['W', 'Z']]

          W         Z
A  0.927959 -1.101338
B -0.593899 -1.385383
C -1.090538 -0.188058
D  0.992114 -0.846037
E -1.131430  0.133448

In [12]:
df['new'] = "1 2 3 4 5".split()
df

          W         X         Y         Z new
A  0.927959 -1.604756  0.454756 -1.101338   1
B -0.593899 -0.697336 -0.373440 -1.385383   2
C -1.090538  1.660876 -0.576661 -0.188058   3
D  0.992114  2.440539  0.405185 -0.846037   4
E -1.131430 -0.860146  0.708441  0.133448   5

In [13]:
df.drop('new', axis=1)

          W         X         Y         Z
A  0.927959 -1.604756  0.454756 -1.101338
B -0.593899 -0.697336 -0.373440 -1.385383
C -1.090538  1.660876 -0.576661 -0.188058
D  0.992114  2.440539  0.405185 -0.846037
E -1.131430 -0.860146  0.708441  0.133448

In [15]:
df.drop('A')

          W         X         Y         Z new
B -0.593899 -0.697336 -0.373440 -1.385383   2
C -1.090538  1.660876 -0.576661 -0.188058   3
D  0.992114  2.440539  0.405185 -0.846037   4
E -1.131430 -0.860146  0.708441  0.133448   5

In [16]:
df.drop('new', axis=1, inplace=True)

In [17]:
df

          W         X         Y         Z
A  0.927959 -1.604756  0.454756 -1.101338
B -0.593899 -0.697336 -0.373440 -1.385383
C -1.090538  1.660876 -0.576661 -0.188058
D  0.992114  2.440539  0.405185 -0.846037
E -1.131430 -0.860146  0.708441  0.133448

In [18]:
df.loc['A']

W    0.927959
X   -1.604756
Y    0.454756
Z   -1.101338
Name: A, dtype: float64

In [20]:
type(df.loc['A'])

pandas.core.series.Series

In [23]:
df.loc['A', 'W']

0.9279592513150532

In [24]:
df.loc[['A', 'B']]

          W         X         Y         Z
A  0.927959 -1.604756  0.454756 -1.101338
B -0.593899 -0.697336 -0.373440 -1.385383

In [25]:
df.loc[['A', 'B'], 'Y']

A    0.454756
B   -0.373440
Name: Y, dtype: float64

In [26]:
df>0

       W      X      Y      Z
A   True  False   True  False
B  False  False  False  False
C  False   True  False  False
D   True   True   True  False
E  False  False   True   True

In [27]:
df[df>0]

          W         X         Y         Z
A  0.927959       NaN  0.454756       NaN
B       NaN       NaN       NaN       NaN
C       NaN  1.660876       NaN       NaN
D  0.992114  2.440539  0.405185       NaN
E       NaN       NaN  0.708441  0.133448

In [35]:
df.loc[['A']][df>0]

          W   X         Y   Z
A  0.927959 NaN  0.454756 NaN

In [38]:
df[df['W']>0]

          W         X         Y         Z
A  0.927959 -1.604756  0.454756 -1.101338
D  0.992114  2.440539  0.405185 -0.846037

In [70]:
df[df['W']>0]['Y']

A    0.454756
D    0.405185
Name: Y, dtype: float64

In [72]:
df[df>0]

          W         X         Y         Z
A  0.927959       NaN  0.454756       NaN
B       NaN       NaN       NaN       NaN
C       NaN  1.660876       NaN       NaN
D  0.992114  2.440539  0.405185       NaN
E       NaN       NaN  0.708441  0.133448

In [73]:
cool_series = pd.Series([1, 2, 3, 4, 5])
cool_series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [78]:
df[df['W']>0][['W', 'Z']]

          W         Z
A  0.927959 -1.101338
D  0.992114 -0.846037

In [85]:
df[(df['W']>0) & (df['Z']>0)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [95]:
df['new_index'] = ['TN', 'DE', 'MH', 'RJ', 'PE']
df.set_index('new_index')
df.rename(columns={'W':'TN', 'X':'DE', "Y":'MH', "Z":'RJ'})

         TN        DE        MH        RJ new_index
A  0.927959 -1.604756  0.454756 -1.101338        TN
B -0.593899 -0.697336 -0.373440 -1.385383        DE
C -1.090538  1.660876 -0.576661 -0.188058        MH
D  0.992114  2.440539  0.405185 -0.846037        RJ
E -1.131430 -0.860146  0.708441  0.133448        PE

In [96]:
df

          W         X         Y         Z new_index
A  0.927959 -1.604756  0.454756 -1.101338        TN
B -0.593899 -0.697336 -0.373440 -1.385383        DE
C -1.090538  1.660876 -0.576661 -0.188058        MH
D  0.992114  2.440539  0.405185 -0.846037        RJ
E -1.131430 -0.860146  0.708441  0.133448        PE

In [97]:
df.set_axis(['V', 'W', 'X', 'Y', 'Z'], axis=1, inplace=False)

          V         W         X         Y   Z
A  0.927959 -1.604756  0.454756 -1.101338  TN
B -0.593899 -0.697336 -0.373440 -1.385383  DE
C -1.090538  1.660876 -0.576661 -0.188058  MH
D  0.992114  2.440539  0.405185 -0.846037  RJ
E -1.131430 -0.860146  0.708441  0.133448  PE

In [98]:
df

          W         X         Y         Z new_index
A  0.927959 -1.604756  0.454756 -1.101338        TN
B -0.593899 -0.697336 -0.373440 -1.385383        DE
C -1.090538  1.660876 -0.576661 -0.188058        MH
D  0.992114  2.440539  0.405185 -0.846037        RJ
E -1.131430 -0.860146  0.708441  0.133448        PE

In [100]:
df.loc['F'] = randn(5)
df

          W         X         Y         Z new_index
A  0.927959 -1.604756  0.454756 -1.101338        TN
B -0.593899 -0.697336 -0.373440 -1.385383        DE
C -1.090538  1.660876 -0.576661 -0.188058        MH
D  0.992114  2.440539  0.405185 -0.846037        RJ
E -1.131430 -0.860146  0.708441  0.133448        PE
F -0.736617 -2.025923  1.689159  0.509628 -0.743017